CSI API ETABS v1
cFrameObj.GetLoadTemperature Method
 Retrieves the temperature load assignments to frame objects.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetLoadTemperature(
	string Name,
	ref int NumberItems,
	ref string[] FrameName,
	ref string[] LoadPat,
	ref int[] MyType,
	ref double[] Val,
	ref string[] PatternName,
	eItemType ItemType = eItemType.Objects
)
Function GetLoadTemperature (
	Name As String,
	ByRef NumberItems As Integer,
	ByRef FrameName As String(),
	ByRef LoadPat As String(),
	ByRef MyType As Integer(),
	ByRef Val As Double(),
	ByRef PatternName As String(),
	Optional ItemType As eItemType = eItemType.Objects
) As Integer
Dim instance As cFrameObj
Dim Name As String
Dim NumberItems As Integer
Dim FrameName As String()
Dim LoadPat As String()
Dim MyType As Integer()
Dim Val As Double()
Dim PatternName As String()
Dim ItemType As eItemType
Dim returnValue As Integer
returnValue = instance.GetLoadTemperature(Name,
	NumberItems, FrameName, LoadPat,
	MyType, Val, PatternName, ItemType)
int GetLoadTemperature(
	String^ Name,
	int% NumberItems,
	array<String^>^% FrameName,
	array<String^>^% LoadPat,
	array<int>^% MyType,
	array<double>^% Val,
	array<String^>^% PatternName,
	eItemType ItemType = eItemType::Objects
)
abstract GetLoadTemperature :
        Name : string *
        NumberItems : int byref *
        FrameName : string[] byref *
        LoadPat : string[] byref *
        MyType : int[] byref *
        Val : float[] byref *
        PatternName : string[] byref *
        ?ItemType : eItemType
(* Defaults:
        let _ItemType = defaultArg ItemType eItemType.Objects
*)
-> int
Parameters
Name
Type: System.String
 The name of an existing frame object or group, depending on the value of the ItemType item.
NumberItems
Type: System.Int32
 The total number of temperature loads retrieved for the specified frame objects.
FrameName
Type: System.String[]
 This is an array that includes the name of the frame object associated with each temperature load.
LoadPat
Type: System.String[]
 This is an array that includes the name of the load pattern associated with each temperature load.
MyType
Type: System.Int32[]
 This is an array that includes 1, 2 or 3, indicating the type of temperature load.
Temperature
Temperature gradient along local 2 axis
Temperature gradient along local 3 axis
Val
Type: System.Double[]
 This is an array that includes the value of the temperature load. [T] when MyType is 1 and [T/L] when MyType is 2
PatternName
Type: System.String[]
 This is an array that includes the joint pattern name, if any, used to specify the temperature load.
ItemType (Optional)
Type: ETABSv1.eItemType
 This is one of the following items in the eItemType enumeration:
Object = 0
Group = 1
SelectedObjects = 2
 If this item is Objects, the assignments are retrieved for the frame object specified by the Name item.
 If this item is Group, the assignments are retrieved for all frame objects in the group specified by the Name item.
 If this item is SelectedObjects, the assignments are retrieved for all selected frame objects and the Name item is ignored.
Return Value
Type: Int32
 Returns zero if the load assignments are successfully retrieved, otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
   Dim NumberItems As Integer
   Dim FrameName() As String
   Dim LoadPat() As String
   Dim MyType() As Integer
   Dim Val() As Double
   Dim PatternName() As String
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
  ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
   ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'assign frame temperature load
   ret = SapModel.FrameObj.SetLoadTemperature("All", "DEAD", 1, 50, , , eItemType.Group)
'get frame temperature load
   ret = SapModel.FrameObj.GetLoadTemperature("ALL", NumberItems, FrameName, LoadPat, MyType, Val, PatternName, eItemType.Group)
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cFrameObj Interface
ETABSv1 Namespace